Iteration and Sorting Dataset

In [7]:
import pandas as pd
import seaborn as sb
import numpy as np

Iteration

In [8]:
#1. Write a Pandas program to iterate through titanic DataFrame available in seaborn
titanic= sb.load_dataset('titanic')
#print(type(titanic))

head_5= titanic.head(5)
for row_index, row in head_5.iterrows():
  print(row_index)
  print(row)

0
survived                 0
pclass                   3
sex                   male
age                     22
sibsp                    1
parch                    0
fare                  7.25
embarked                 S
class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                False
Name: 0, dtype: object
1
survived               1
pclass                 1
sex               female
age                   38
sibsp                  1
parch                  0
fare             71.2833
embarked               C
class              First
who                woman
adult_male         False
deck                   C
embark_town    Cherbourg
alive                yes
alone              False
Name: 1, dtype: object
2
survived                 1
pclass                   3
sex                 female
age                     26
sibsp                    0
parch                    0
fare                 7.925
embarked                 S
class                Third
who                  woman
adult_male           False
deck                   NaN
embark_town    Southampton
alive                  yes
alone                 True
Name: 2, dtype: object
3
survived                 1
pclass                   1
sex                 female
age                     35
sibsp                    1
parch                    0
fare                  53.1
embarked                 S
class                First
who                  woman
adult_male           False
deck                     C
embark_town    Southampton
alive                  yes
alone                False
Name: 3, dtype: object
4
survived                 0
pclass                   3
sex                   male
age                     35
sibsp                    0
parch                    0
fare                  8.05
embarked                 S
class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                 True
Name: 4, dtype: object

In [13]:
#2. iterate through each column as key and value pair
for key,value in head_5.iteritems():
  print(key,value)

survived 0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64
pclass 0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: pclass, Length: 891, dtype: int64
sex 0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object
age 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64
sibsp 0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    1
889    0
890    0
Name: sibsp, Length: 891, dtype: int64
parch 0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    2
889    0
890    0
Name: parch, Length: 891, dtype: int64
fare 0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64
embarked 0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: embarked, Length: 891, dtype: object
class 0       Third
1       First
2       Third
3       First
4       Third
        ...
886    Second
887     First
888     Third
889     First
890     Third
Name: class, Length: 891, dtype: category
Categories (3, object): ['First', 'Second', 'Third']
who 0        man
1      woman
2      woman
3      woman
4        man
       ...
886      man
887    woman
888    woman
889      man
890      man
Name: who, Length: 891, dtype: object
adult_male 0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: adult_male, Length: 891, dtype: bool
deck 0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']
embark_town 0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object
alive 0       no
1      yes
2      yes
3      yes
4       no
      ...
886     no
887    yes
888     no
889    yes
890     no
Name: alive, Length: 891, dtype: object
alone 0      False
1      False
2       True
3      False
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: alone, Length: 891, dtype: bool

In [ ]:
#3. iterate through rows as tuples
for row in head_5.itertuples():
  print(row)

Sorting

In [14]:
#4. sort by index
print(head_5.sort_index(ascending= True))

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [15]:
#5. sort by column name
print(head_5.sort_index(axis=1))

   adult_male   age alive  alone  class  ... pclass     sex sibsp  survived    who
0        True  22.0    no  False  Third  ...      3    male     1         0    man
1       False  38.0   yes  False  First  ...      1  female     1         1  woman
2       False  26.0   yes   True  Third  ...      3  female     0         1  woman
3       False  35.0   yes  False  First  ...      1  female     1         1  woman
4        True  35.0    no   True  Third  ...      3    male     0         0    man

[5 rows x 15 columns]

In [16]:
#6. sort by age column
print(head_5.sort_values(by= ['age'],ascending= True))

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True
1         1       1  female  38.0  ...     C    Cherbourg    yes  False

[5 rows x 15 columns]

In [9]:
#7. Write a Pandas program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order
exam_data  = pd.DataFrame(
    {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
)

print('Original Dataframe')
print(exam_data)

Original Dataframe
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [10]:
sort_name= exam_data.sort_values(by=['name'], ascending= [False])
print('Dataframe on sorting in descending order by name')
print(sort_name)

Dataframe on sorting in descending order by name
        name  score  attempts qualify
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
2  Katherine   16.5         2     yes
9      Jonas   19.0         1     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
1       Dima    9.0         3      no
0  Anastasia   12.5         1     yes

In [11]:
sort_score= exam_data.sort_values(by=['score'], ascending= [True])
print('Dataframe on sorting in ascending order by score')
print(sort_score)

Dataframe on sorting in ascending order by score
        name  score  attempts qualify
8      Kevin    8.0         2      no
1       Dima    9.0         3      no
4      Emily    9.0         2      no
0  Anastasia   12.5         1     yes
6    Matthew   14.5         1     yes
2  Katherine   16.5         2     yes
9      Jonas   19.0         1     yes
5    Michael   20.0         3     yes
3      James    NaN         3      no
7      Laura    NaN         1      no

In [12]:
exam_data= exam_data.sort_values(by=['name','score'], ascending= [False,True])
print('Dataframe on sorting in descending order by name and then score in ascending order')
print(exam_data)

Dataframe on sorting in descending order by name and then score in ascending order
        name  score  attempts qualify
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
2  Katherine   16.5         2     yes
9      Jonas   19.0         1     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
1       Dima    9.0         3      no
0  Anastasia   12.5         1     yes

In [17]:
#8. use quick sort 
print(exam_data.sort_values(by=['score'], ascending= [True],kind='quicksort'))

        name  score  attempts qualify
8      Kevin    8.0         2      no
4      Emily    9.0         2      no
1       Dima    9.0         3      no
0  Anastasia   12.5         1     yes
6    Matthew   14.5         1     yes
2  Katherine   16.5         2     yes
9      Jonas   19.0         1     yes
5    Michael   20.0         3     yes
7      Laura    NaN         1      no
3      James    NaN         3      no

In [18]:
#9. use tips dataset and sort by index in descending order
tips= sb.load_dataset('tips')
print(tips.head())

tips= tips.sort_index(ascending=False)
print(tips.head())

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
     total_bill   tip     sex smoker   day    time  size
243       18.78  3.00  Female     No  Thur  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
239       29.03  5.92    Male     No   Sat  Dinner     3

In [19]:
#10. sort tips dataset by total_bill in ascending order
sorted_tips= tips.sort_values(by=['total_bill'], ascending= True)
print(sorted_tips.head())

     total_bill   tip     sex smoker   day    time  size
67         3.07  1.00  Female    Yes   Sat  Dinner     1
92         5.75  1.00  Female    Yes   Fri  Dinner     2
172        7.25  5.15    Male    Yes   Sun  Dinner     2
111        7.25  1.00  Female     No   Sat  Dinner     1
149        7.51  2.00    Male     No  Thur   Lunch     2